app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE (title LIKE '%Ridley Scott%' OR description LIKE '%Ridley Scott%' OR director LIKE '%Ridley Scott%') ORDER BY created_at DESC
---
  def index
    @movies = Movie.all

SELECT "reviews".* FROM "reviews" WHERE "reviews"."movie_id" = ?  ORDER BY created_at DESC  [["movie_id", 3]]
SELECT AVG("reviews"."rating") FROM "reviews" WHERE "reviews"."movie_id" = ?  [["movie_id", 2]]
---
  def show
    @reviews = Review.where(movie_id: @movie.id).order("created_at DESC")

    if @reviews.blank?
      @avg_review = 0
    else
      @avg_review = @reviews.average(:rating).round(2) if @avg_review

INSERT INTO "movies" ("title", "description", "movie_length", "director", "rating", "image_file_name", "image_content_type", "image_file_size", "image_updated_at", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @movie = current_user.movies.build(movie_params)

    respond_to do |format|
      if @movie.save

UPDATE "movies" SET "rating" = ?, "image_file_name" = ?, "image_file_size" = ?, "image_updated_at" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["rating", "5"], ["image_file_name", "martian.jpg"], ["image_file_size", 221340], ["image_updated_at", "2017-08-03 22:40:33.157135"], ["updated_at", "2017-08-03 22:40:33.166487"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @movie.update(movie_params)