app/controllers/reviews_controller.rb

INSERT INTO "reviews" ("rating", "comment", "user_id", "movie_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["rating", 4], ["comment", "Ant-Man was a super cool movie"], ["user_id", 1], ["movie_id", 2], ["created_at", "2015-10-06 17:09:47.699829"], ["updated_at", "2015-10-06 17:09:47.699829"]]
---
  def create
    @review = Review.new(review_params)
    @review.user_id = current_user.id
    @review.movie_id = @movie.id

  if @review.save